Dlubal.RFEM5.NodalLoadDirectionType
Direction of nodal load

Dlubal.RFEM5.NodalLoadDirectionType.UnknownNodalLoadDirectionType
Unknown nodal load direction

Dlubal.RFEM5.NodalLoadDirectionType.RotatedDirectionType
Rotated

Dlubal.RFEM5.NodalLoadDirectionType.CoordinateSystemDirectionType
Coordinate system

Dlubal.RFEM5.NodalLoadDirectionType.DirectToNodeType
Direct to node

Dlubal.RFEM5.NodalLoadDirectionType.TwoNodesDirectionType
Load direction is defined by two nodes

Dlubal.RFEM5.NodalLoadDirectionType.SameAsMemberDirectionType
Load direction is the same as member

Dlubal.RFEM5.NodalLoadDirectionType.SameAsLineDirectionType
Load direction is the same as line